package com.tigerjoys.shark.miai;

import java.io.IOException;
import java.nio.charset.StandardCharsets;
import java.nio.file.Files;
import java.nio.file.Paths;
import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;
import java.util.Map;

import org.shark.miai.common.util.BaiduUtils;
import org.shark.miai.common.util.BmapPoint;

import com.alibaba.fastjson.JSONArray;
import com.alibaba.fastjson.JSONObject;
import com.tigerjoys.nbs.common.utils.JsonHelper;
import com.tigerjoys.nbs.common.utils.PinyinUtil;
import com.tigerjoys.nbs.common.utils.Tools;

public class CityMain {
	
	private static class Country {
		private String name;
		
		private String ename;
		
		private String spell;
		
		private char initial;
		
		private List<Province> provinceList = new ArrayList<>();
		
		public Country(String name , String ename , String spell , char initial) {
			this.name = name;
			this.ename = ename;
			this.spell = spell;
			this.initial = initial;
		}
	}
	
	private static class Province {
		private String name;
		
		private String ename;
		
		private String spell;
		
		private char initial;
		
		private List<City> cityList = new ArrayList<>();
		
		public Province(String name , String ename , String spell , char initial) {
			this.name = name;
			this.ename = ename;
			this.spell = spell;
			this.initial = initial;
		}
	}
	
	private static class City {
		private String name;
		
		private String ename;
		
		private String spell;
		
		private char initial;
		
		public City(String name , String ename , String spell , char initial) {
			this.name = name;
			this.ename = ename;
			this.spell = spell;
			this.initial = initial;
		}
	}
	
	private static Map<String , String> mapping_Map = new HashMap<>();
	
	private static Map<String , String> mapping_country_map = new HashMap<>();
	
	private static List<Country> countryList = new ArrayList<>();
	
	private static Map<String , String> old_city_ename = new HashMap<>();
	
	private static void initOld(){
		String[] ss = new String[]{"北京#bj","上海#sh","天津#tj","重庆#cq","济南#jn","烟台#yt","青岛#qd","潍坊#wf","淄博#zb","泰安#ta","聊城#lc","济宁#jining","临沂#linyi","威海#weihai","枣庄#zaozhuang","德州#dz","日照#rizhao","东营#dy","菏泽#heze","滨州#bz","莱芜#lw","章丘#zhangqiu","垦利#kl","诸城#zc","苏州#su","南京#nj","无锡#wx","常州#cz","徐州#xz","南通#nt","扬州#yz","盐城#yancheng","淮安#ha","连云港#lyg","泰州#taizhou","宿迁#suqian","镇江#zj","沭阳#shuyang","大丰#dafeng","杭州#hz","宁波#nb","温州#wz","金华#jh","嘉兴#jx","台州#tz","绍兴#sx","湖州#huzhou","丽水#lishui","衢州#quzhou","舟山#zhoushan","乐清#yueqingcity","瑞安#ruiancity","义乌#yiwu","合肥#hf","芜湖#wuhu","蚌埠#bengbu","阜阳#fy","淮南#hn","安庆#anqing","宿州#suzhou","六安#la","淮北#huaibei","滁州#chuzhou","马鞍山#mas","铜陵#tongling","宣城#xuancheng","黄山#huangshan","池州#chizhou","巢湖#ch","和县#hexian","霍邱#hq","桐城#tongcheng","深圳#sz","广州#gz","东莞#dg","佛山#fs","中山#zs","珠海#zh","惠州#huizhou","江门#jm","汕头#st","湛江#zhanjiang","肇庆#zq","茂名#mm","揭阳#jy","梅州#mz","清远#qingyuan","阳江#yj","韶关#sg","河源#heyuan","云浮#yf","汕尾#sw","潮州#chaozhou","台山#taishan","阳春#yangchun","顺德#sd","福州#fz","厦门#xm","泉州#qz","莆田#pt","漳州#zhangzhou","宁德#nd","三明#sm","南平#np","龙岩#ly","武夷山#wuyishan","南宁#nn","柳州#liuzhou","桂林#gl","玉林#yulin","梧州#wuzhou","北海#bh","贵港#gg","钦州#qinzhou","百色#baise","河池#hc","来宾#lb","贺州#hezhou","防城港#fcg","崇左#chongzuo","海口#haikou","三亚#sanya","五指山#wzs","三沙#sansha","郑州#zz","洛阳#luoyang","新乡#xx","南阳#ny","许昌#xc","平顶山#pds","安阳#ay","焦作#jiaozuo","商丘#sq","开封#kaifeng","濮阳#puyang","周口#zk","信阳#xy","驻马店#zmd","漯河#luohe","三门峡#smx","鹤壁#hb","济源#jiyuan","明港#mg","鄢陵#yanling","禹州#yuzhou","长葛#changge","武汉#wh","宜昌#yc","襄阳#xf","荆州#jingzhou","十堰#shiyan","黄石#hshi","孝感#xiaogan","黄冈#hg","恩施#es","荆门#jingmen","咸宁#xianning","鄂州#ez","随州#suizhou","潜江#qianjiang","天门#tm","仙桃#xiantao","神农架#snj","长沙#cs","株洲#zhuzhou","益阳#yiyang","常德#changde","衡阳#hy","湘潭#xiangtan","岳阳#yy","郴州#chenzhou","邵阳#shaoyang","怀化#hh","永州#yongzhou","娄底#ld","湘西#xiangxi","张家界#zjj","南昌#nc","赣州#ganzhou","九江#jj","宜春#yichun","吉安#ja","上饶#sr","萍乡#px","抚州#fuzhou","景德镇#jdz","新余#xinyu","鹰潭#yingtan","永新#yxx","沈阳#sy","大连#dl","鞍山#as","锦州#jinzhou","抚顺#fushun","营口#yk","盘锦#pj","朝阳#cy","丹东#dandong","辽阳#liaoyang","本溪#benxi","葫芦岛#hld","铁岭#tl","阜新#fx","庄河#pld","瓦房店#wfd","哈尔滨#hrb","大庆#dq","齐齐哈尔#qqhr","牡丹江#mdj","绥化#suihua","佳木斯#jms","鸡西#jixi","双鸭山#sys","鹤岗#hegang","黑河#heihe","伊春#yich","七台河#qth","大兴安岭#dxal","长春#cc","吉林#jl","四平#sp","延边#yanbian","松原#songyuan","白城#bc","通化#th","白山#baishan","辽源#liaoyuan","成都#cd","绵阳#mianyang","德阳#deyang","南充#nanchong","宜宾#yb","自贡#zg","乐山#ls","泸州#luzhou","达州#dazhou","内江#scnj","遂宁#suining","攀枝花#panzhihua","眉山#ms","广安#ga","资阳#zy","凉山#liangshan","广元#guangyuan","雅安#ya","巴中#bazhong","阿坝#ab","甘孜#ganzi","昆明#km","曲靖#qj","大理#dali","红河#honghe","玉溪#yx","丽江#lj","文山#ws","楚雄#cx","西双版纳#bn","昭通#zt","德宏#dh","普洱#pe","保山#bs","临沧#lincang","迪庆#diqing","怒江#nujiang","贵阳#gy","遵义#zunyi","黔东南#qdn","黔南#qn","六盘水#lps","毕节#bijie","铜仁#tr","安顺#anshun","黔西南#qxn","拉萨#lasa","日喀则#rkz","山南#sn","林芝#linzhi","昌都#changdu","那曲#nq","阿里#al","石家庄#sjz","保定#bd","唐山#ts","廊坊#lf","邯郸#hd","秦皇岛#qhd","沧州#cangzhou","邢台#xt","衡水#hs","张家口#zjk","承德#chengde","定州#dingzhou","馆陶#gt","张北#zhangbei","赵县#zx","正定#zd","太原#ty","临汾#linfen","大同#dt","运城#yuncheng","晋中#jz","长治#changzhi","晋城#jincheng","阳泉#yq","吕梁#lvliang","忻州#xinzhou","朔州#shuozhou","临猗#linyixian","清徐#qingxu","呼和浩特#hu","包头#bt","赤峰#chifeng","鄂尔多斯#erds","通辽#tongliao","呼伦贝尔#hlbe","巴彦淖尔市#bycem","乌兰察布#wlcb","锡林郭勒盟#xl","兴安盟#xam","乌海#wuhai","阿拉善盟#alsm","海拉尔#hlr","西安#xa","咸阳#xianyang","宝鸡#baoji","渭南#wn","汉中#hanzhong","榆林#yl","延安#yanan","安康#ankang","商洛#sl","铜川#tc","乌鲁木齐#xj","昌吉#changji","巴音郭楞#bygl","伊犁#yili","阿克苏#aks","喀什#ks","哈密#hami","克拉玛依#klmy","博尔塔拉#betl","吐鲁番#tlf","和田#ht","石河子#shz","克孜勒苏#kzls","阿拉尔#ale","五家渠#wjq","图木舒克#tmsk","兰州#lz","天水#tianshui","白银#by","庆阳#qingyang","平凉#pl","酒泉#jq","张掖#zhangye","武威#wuwei","定西#dx","金昌#jinchang","陇南#ln","临夏#linxia","嘉峪关#jyg","甘南#gn","银川#yinchuan","吴忠#wuzhong","石嘴山#szs","中卫#zw","固原#guyuan","西宁#xn","海西#hx","海北#haibei","果洛#guoluo","海东#haidong","黄南#huangnan","玉树#ys","海南#hainan","香港#hk","澳门#am","台湾#tw","亳州#bozhou"};
		
		for(String s : ss) {
			String name = s.split("#")[0];
			String ename = s.split("#")[1];
			
			old_city_ename.put(name, ename);
		}
	}
	
	private static String loadFile(String file) throws IOException {
		StringBuilder buf = new StringBuilder();
		Files.lines(Paths.get(file), StandardCharsets.UTF_8).forEach(buf :: append);
		
		return buf.toString();
	}
	
	private static void initCountry() throws Exception{
		JSONObject countryMap = JsonHelper.toJsonObject(loadFile("G:/city_en.txt") , true);
		
		System.err.println(countryMap.size());
		
		for(Map.Entry<String , Object> country : countryMap.entrySet()) {
			String name = country.getKey();
			String spell = country.getValue().toString();
			
			String ename = name.split("_")[0];
			
			mapping_Map.put(name, spell);
			
			if(!mapping_country_map.containsKey(ename)) {
				mapping_country_map.put(ename, name.split("_")[1]);
			}
		}
		//额外添加
		mapping_Map.put("BB_巴巴多斯岛", "Barbados");
		mapping_country_map.put("BB", "巴巴多斯岛");
		
		mapping_Map.put("CG_刚果民主共和国", "Congo");
		mapping_country_map.put("CG", "刚果民主共和国");
		
		mapping_Map.put("RE_留尼汪岛", "Reunion Island");
		mapping_country_map.put("RE", "留尼汪岛");
		
		mapping_Map.put("YT_马拉维", "Malawi");
		mapping_country_map.put("YT", "马拉维");
	}
	
	private static void initChina(){
		mapping_Map.put("CN_中国", "China");
		mapping_country_map.put("CN", "中国");
		System.err.println(mapping_Map.size());
	}
	
	private static void sssksk() throws Exception{
		JSONObject countryMap = JsonHelper.toJsonObject(loadFile("G:/city.txt") , true);
		
		System.err.println(countryMap.size());
		System.err.println(mapping_country_map.size());
		
		for(Map.Entry<String , Object> json : countryMap.entrySet()) {
			String country_ename = json.getKey();
			
			//System.err.println(country_ename);
			
			String country_name = mapping_country_map.get(country_ename);
			String country_spell = mapping_Map.get(country_ename+"_"+country_name);
			char country_initial = PinyinUtil.getFirstPinyin(country_name).charAt(0);
			
			System.err.println(country_ename+"--"+country_name+"--"+country_spell + "--" + country_initial);
			
			JSONObject provinceJson = (JSONObject)json.getValue();
			
			Country country = new Country(country_name, country_ename, country_spell, country_initial);
			countryList.add(country);
			
			//此处解析省份
			for(Map.Entry<String , Object> provinceObject : provinceJson.entrySet()) {
				String province_name = provinceObject.getKey();
				String province_ename = mapping_Map.get(country_ename+"_"+province_name);;
				String province_spell = province_ename;
				char province_initial = PinyinUtil.getFirstPinyin(province_name).charAt(0);
				
				System.err.println(province_name+"--"+province_name+"--"+province_spell + "--" + province_initial);
				
				JSONArray cityJson = (JSONArray)provinceObject.getValue();
				
				Province province = new Province(province_name, province_ename, province_spell, province_initial);
				country.provinceList.add(province);
				
				//此处解析城市
				for(int y=0;y<cityJson.size();y++) {
					String city_name = cityJson.getString(y);
					String city_ename = mapping_Map.get(country_ename+"_"+city_name);;
					String city_spell = province_ename;
					char city_initial = PinyinUtil.getFirstPinyin(city_name).charAt(0);
					
					System.err.println(city_ename+"--"+city_name+"--"+city_spell + "--" + city_initial);
					
					City city = new City(city_name, city_ename, city_spell, city_initial);
					province.cityList.add(city);
				}
			}
		}
		
		System.err.println("===============================================================");
		System.err.println("===============================================================");
		System.err.println("===============================================================");
		System.err.println("===============================================================");
		
		//此处添加中国的国家，省份，城市信息
		Country china = new Country("中国", "CN", "China", 'c');
		countryList.add(china);
		
		//此处load省份和城市
		String[] ss = new String[]{"北京","上海","香港","台湾","广东","浙江","江苏","四川","重庆","湖南","湖北","福建","广西","山东","河南","河北","辽宁","陕西","安徽","天津","江西","云南","黑龙江","山西","吉林","贵州","海南","甘肃","青海","宁夏","内蒙古","新疆","西藏","澳门"};
		JSONArray chinaProvince = JsonHelper.toJsonArray(loadFile("G:/city.json"));
		for(int i=0;i<chinaProvince.size();i++) {
			String province_name = ss[i];
			String province_spell = PinyinUtil.getFullPinyin(province_name);
			String province_ename = Tools.formatString(old_city_ename.get(province_name), province_spell);
			char province_initial = province_spell.charAt(0);
			
			System.err.println(province_name+"--"+province_name+"--"+province_spell + "--" + province_initial);
			
			JSONArray cityJson = chinaProvince.getJSONObject(i).getJSONArray(province_name);
			
			Province province = new Province(province_name, province_ename, province_spell, province_initial);
			china.provinceList.add(province);
			
			//加载城市
			for(int j=0;j<cityJson.size();j++) {
				String city_name = cityJson.getString(j);
				String city_spell = PinyinUtil.getFullPinyin(city_name);
				String city_ename = Tools.formatString(old_city_ename.get(city_name), city_spell);
				char city_initial = city_ename.charAt(0);
				
				System.err.println(city_ename+"--"+city_name+"--"+city_spell + "--" + city_initial);
				
				City city = new City(city_name, city_ename, city_spell, city_initial);
				province.cityList.add(city);
			}
		}
	}
	
	private static void p(){
		//输出sql文件
		int index = 0;
		for(int i=0;i<countryList.size();i++) {
			index++;
			
			Country country = countryList.get(i);
			int countryId = index;
			print(index, country.name, country.ename, country.spell, country.initial, 0, 0, true);
			
			for(int j=0;j<country.provinceList.size();j++) {
				index++;
				
				Province province = country.provinceList.get(j);
				int provinceId = index;
				print(index, province.name, province.ename, province.spell, province.initial, 1, countryId, true);
				
				for(int x = 0;x<province.cityList.size();x++) {
					index++;
					
					City city = province.cityList.get(x);
					print(index, city.name, city.ename, city.spell, city.initial, 2, provinceId, false);
				}
			}
		}
	}
	
	private static void print(int index , String name , String ename , String spell , char initial , int depth , int pid , boolean hasChildren) {
		//System.err.println(name+"--"+ename+"--"+spell);
		String s = "INSERT INTO t_app_area VALUES ('"+index+"', '2017-07-20 00:00:00', '2017-07-20 00:00:00', '"+name+"', '"+ename.replace("'", "\\\'")+"', '"+spell.replace("'", "\\\'")+"', '"+initial+"', '0', '"+depth+"', '"+pid+"', '"+(hasChildren?1:0)+"', '1000', '1', null, '0.0000000000', '0.0000000000', '0');";
		System.err.println(s);
	}
	
	private static Map<String , String> baiduCodeMap = new HashMap<>();
	
	private static void baiduCode(){
		String[] ss = new String[]{"中国|1","安徽|23","福建|16","甘肃|6","广东|7","广西|17","贵州|24","海南|21","河北|25","黑龙江|2","河南|30","湖北|15","湖南|26","江苏|18","江西|31","吉林省|9","辽宁|19","内蒙古|22","宁夏|20","青海|11","山东|8","山西|10","陕西|27","四川|32","新疆|12","西藏|13","云南|28","浙江|29","北京|131","天津|332","石家庄|150","唐山|265","秦皇岛|148","邯郸|151","邢台|266","保定|307","张家口|264","承德|207","沧州|149","廊坊|191","衡水|208","太原|176","大同|355","阳泉|357","长治|356","晋城|290","朔州|237","晋中|238","运城|328","忻州|367","临汾|368","吕梁|327","呼和浩特|321","包头|229","乌海|123","赤峰|297","通辽|64","鄂尔多斯|283","呼伦贝尔|61","巴彦淖尔|169","乌兰察布|168","兴安盟|62","锡林郭勒盟|63","阿拉善盟|230","沈阳|58","大连|167","鞍山|320","抚顺|184","本溪|227","丹东|282","锦州|166","营口|281","阜新|59","辽阳|351","盘锦|228","铁岭|60","朝阳|280","葫芦岛|319","长春|53","吉林市|55","四平|56","辽源|183","通化|165","白山|57","松原|52","白城|51","延边朝鲜族自治州|54","哈尔滨|48","齐齐哈尔|41","鸡西|46","鹤岗|43","双鸭山|45","大庆|50","伊春|40","佳木斯|42","七台河|47","牡丹江|49","黑河|39","绥化|44","大兴安岭地区|38","上海|289","南京|315","无锡|317","徐州|316","常州|348","苏州|224","南通|161","连云港|347","淮安|162","盐城|223","扬州|346","镇江|160","泰州|276","宿迁|277","杭州|179","宁波|180","温州|178","嘉兴|334","湖州|294","绍兴|293","金华|333","衢州|243","舟山|245","台州|244","丽水|292","合肥|127","芜湖|129","蚌埠|126","淮南|250","马鞍山|358","淮北|253","铜陵|337","安庆|130","黄山|252","滁州|189","阜阳|128","宿州|370","巢湖|251","六安|298","亳州|188","池州|299","宣城|190","福州|300","厦门|194","莆田|195","三明|254","泉州|134","漳州|255","南平|133","龙岩|193","宁德|192","南昌|163","景德镇|225","萍乡|350","九江|349","新余|164","鹰潭|279","赣州|365","吉安|318","宜春|278","抚州|226","上饶|364","济南|288","青岛|236","淄博|354","枣庄|172","东营|174","烟台|326","潍坊|287","济宁|286","泰安|325","威海|175","日照|173","莱芜|124","临沂|234","德州|372","聊城|366","滨州|235","菏泽|353","郑州|268","开封|210","洛阳|153","平顶山|213","安阳|267","鹤壁|215","新乡|152","焦作|211","濮阳|209","许昌|155","漯河|344","三门峡|212","南阳|309","商丘|154","信阳|214","周口|308","驻马店|269","武汉|218","黄石|311","十堰|216","宜昌|270","襄阳|156","鄂州|122","荆门|217","孝感|310","荆州|157","黄冈|271","咸宁|362","随州|371","恩施土家族苗族自治州|373","仙桃|1713","潜江|1293","天门|2654","神农架林区|2734","长沙|158","株洲|222","湘潭|313","衡阳|159","邵阳|273","岳阳|220","常德|219","张家界|312","益阳|272","郴州|275","永州|314","怀化|363","娄底|221","湘西土家族苗族自治州|274","广州|257","韶关|137","深圳|340","珠海|140","汕头|303","佛山|138","江门|302","湛江|198","茂名|139","肇庆|338","惠州|301","梅州|141","汕尾|339","河源|200","阳江|199","清远|197","东莞|119","中山|187","潮州|201","揭阳|259","云浮|258","南宁|261","柳州|305","桂林|142","梧州|304","北海|295","防城港|204","钦州|145","贵港|341","玉林|361","百色|203","贺州|260","河池|143","来宾|202","崇左|144","海口|125","三亚|121","五指山|1644","琼海|2358","儋州|1215","文昌|2758","万宁|1216","东方|2634","定安|1214","屯昌|1641","澄迈|2757","临高|2033","白沙黎族自治|2359","昌江黎族自治|1642","乐东黎族自治|2032","陵水黎族自治|1643","保亭黎族苗族自治|1217","琼中黎族苗族自治|2031","重庆|132","成都|75","自贡|78","攀枝花|81","泸州|331","德阳|74","绵阳|240","广元|329","遂宁|330","内江|248","乐山|79","南充|291","眉山|77","宜宾|186","广安|241","达州|369","雅安|76","巴中|239","资阳|242","阿坝藏族羌族自治州|185","甘孜藏族自治州|73","凉山彝族自治州|80","贵阳|146","六盘水|147","遵义|262","安顺|263","铜仁地区|205","黔西南布依族苗族自治州|343","毕节地区|206","黔东南苗族侗族自治州|342","黔南布依族苗族自治州|306","昆明|104","曲靖|249","玉溪|106","保山|112","昭通|336","丽江|114","临沧|110","楚雄彝族自治州|105","红河哈尼族彝族自治州|107","文山壮族苗族自治州|177","普洱|108","西双版纳傣族自治州|109","大理白族自治州|111","德宏傣族景颇族自治州|116","怒江傈僳族自治州|113","迪庆藏族自治州|115","拉萨|100","昌都地区|99","山南地区|97","日喀则地区|102","那曲地区|101","阿里地区|103","林芝地区|98","西安|233","铜川|232","宝鸡|171","咸阳|323","渭南|170","延安|284","汉中|352","榆林|231","安康|324","商洛|285","兰州|36","嘉峪关|33","金昌|34","白银|35","天水|196","武威|118","张掖|117","平凉|359","酒泉|37","庆阳|135","定西|136","陇南|256","临夏回族自治州|182","甘南藏族自治州|247","西宁|66","海东地区|69","海北藏族自治州|67","黄南藏族自治州|70","海南藏族自治州|68","果洛藏族自治州|72","玉树藏族自治州|71","海西蒙古族藏族自治州|65","银川|360","石嘴山|335","吴忠|322","固原|246","中卫|181","乌鲁木齐|92","克拉玛依|95","吐鲁番地区|89","哈密地区|91","昌吉回族自治州|93","博尔塔拉蒙古自治州|88","巴音郭楞蒙古自治州|86","阿克苏地区|85","克孜勒苏柯尔克孜自治州|84","喀什地区|83","和田地区|82","伊犁哈萨克自治州|90","塔城地区|94","阿勒泰地区|96","石河子|770","阿拉尔|731","图木舒克|792","五家渠|789","香港特别行政区|2912","澳门特别行政区|2911"};
		for(String s : ss) {
			String name = s.split("\\|")[0].replace("省", "").replace("市", "").replace("蒙古自治州", "").replace("傣族自治州", "").replace("哈尼族彝族自治州", "").replace("自治州", "").replace("特别行政区", "").replace("地区", "").replace("盟", "");
			String code = s.split("\\|")[1];
			
			baiduCodeMap.put(name, code);
		}
		
		System.err.println(baiduCodeMap.size());
	}
	
	private static Map<String , String> sqlCodeMap = new HashMap<>();
	
	private static void initMysqlCity(){
		String[] ss = new String[]{"3593#北京","3612#上海","3631#香港","3652#台湾","3696#广东","3718#浙江","3730#江苏","3744#四川","3766#重庆","3807#湖南","3822#湖北","3840#福建","3850#广西","3865#山东","3883#河南","3902#河北","3914#辽宁","3929#陕西","3940#安徽","3958#天津","3977#江西","3989#云南","4006#黑龙江","4020#山西","4032#吉林","4042#贵州","4052#海南","4074#甘肃","4089#青海","4098#宁夏","4104#内蒙古","4117#新疆","4136#西藏","4144#澳门","3594#昌平","3595#朝阳","3596#崇文","3597#大兴","3598#东城","3599#房山","3600#丰台","3601#海淀","3602#怀柔","3603#门头沟","3604#密云","3605#平谷","3606#石景山","3607#顺义","3608#通州","3609#西城","3610#宣武","3611#延庆","3613#宝山","3614#长宁","3615#崇明","3616#奉贤","3617#虹口","3618#黄浦","3619#嘉定","3620#金山","3621#静安","3622#卢湾","3623#闵行","3624#浦东","3625#普陀","3626#青浦","3627#松江","3628#徐汇","3629#杨浦","3630#闸北","3632#北区","3633#大埔区","3634#东区","3635#观塘区","3636#黄大仙区","3637#九龙","3638#葵青区","3639#离岛区","3640#南区","3641#荃湾区","3642#沙田区","3643#深水埗区","3644#屯门区","3645#湾仔区","3646#西贡区","3647#香港","3648#新界","3649#油尖旺区","3650#元朗区","3651#中西区","3653#台北","3654#阿莲","3655#安定","3656#安平","3657#八德","3658#八里","3659#白河","3660#白沙","3661#板桥","3662#褒忠","3663#宝山","3664#卑南","3665#北斗","3666#北港","3667#北门","3668#北埔","3669#北投","3670#补子","3671#布袋","3672#草屯","3673#长宾","3674#长治","3675#潮州","3676#车城","3677#成功","3678#城中区","3679#池上","3680#春日","3681#刺桐","3682#高雄","3683#花莲","3684#基隆","3685#嘉义","3686#苗栗","3687#南投","3688#屏东","3689#台东","3690#台南","3691#台中","3692#桃园","3693#新竹","3694#宜兰","3695#彰化","3697#广州","3698#韶关","3699#深圳","3700#珠海","3701#汕头","3702#佛山","3703#江门","3704#湛江","3705#茂名","3706#肇庆","3707#惠州","3708#梅州","3709#汕尾","3710#河源","3711#阳江","3712#清远","3713#东莞","3714#中山","3715#潮州","3716#揭阳","3717#云浮","3719#杭州","3720#湖州","3721#嘉兴","3722#金华","3723#丽水","3724#宁波","3725#衢州","3726#绍兴","3727#台州","3728#温州","3729#舟山","3731#南京","3732#常州","3733#淮安","3734#连云港","3735#南通","3736#苏州","3737#宿迁","3738#泰州","3739#无锡","3740#徐州","3741#盐城","3742#扬州","3743#镇江","3745#成都","3746#阿坝","3747#巴中","3748#达州","3749#德阳","3750#甘孜","3751#广安","3752#广元","3753#乐山","3754#凉山","3755#泸州","3756#眉山","3757#绵阳","3758#内江","3759#南充","3760#攀枝花","3761#遂宁","3762#雅安","3763#宜宾","3764#资阳","3765#自贡","3767#巴南","3768#北碚","3769#璧山","3770#长寿","3771#城口","3772#大渡口","3773#大足","3774#垫江","3775#丰都","3776#奉节","3777#涪陵","3778#合川","3779#江北","3780#江津","3781#九龙坡","3782#开县","3783#梁平","3784#南岸","3785#南川","3786#彭水","3787#綦江","3788#黔江","3789#荣昌","3790#沙坪坝","3791#石柱","3792#双桥","3793#铜梁","3794#潼南","3795#万盛","3796#万州","3797#巫山","3798#巫溪","3799#武隆","3800#秀山","3801#永川","3802#酉阳","3803#渝北","3804#渝中","3805#云阳","3806#忠县","3808#长沙","3809#常德","3810#郴州","3811#衡阳","3812#怀化","3813#娄底","3814#邵阳","3815#湘潭","3816#湘西","3817#益阳","3818#永州","3819#岳阳","3820#张家界","3821#株洲","3823#武汉","3824#鄂州","3825#恩施","3826#黄冈","3827#黄石","3828#荆门","3829#荆州","3830#潜江","3831#神农架","3832#十堰","3833#随州","3834#天门","3835#仙桃","3836#咸宁","3837#襄樊","3838#孝感","3839#宜昌","3841#福州","3842#龙岩","3843#南平","3844#宁德","3845#莆田","3846#泉州","3847#三明","3848#厦门","3849#漳州","3851#南宁","3852#柳州","3853#桂林","3854#梧州","3855#北海","3856#防城港","3857#钦州","3858#贵港","3859#玉林","3860#百色","3861#贺州","3862#河池","3863#来宾","3864#崇左","3866#济南","3867#滨州","3868#德州","3869#东营","3870#菏泽","3871#济宁","3872#莱芜","3873#聊城","3874#临沂","3875#青岛","3876#日照","3877#泰安","3878#威海","3879#潍坊","3880#烟台","3881#枣庄","3882#淄博","3884#郑州","3885#安阳","3886#鹤壁","3887#焦作","3888#济源","3889#开封","3890#洛阳","3891#漯河","3892#南阳","3893#平顶山","3894#濮阳","3895#三门峡","3896#商丘","3897#新乡","3898#信阳","3899#许昌","3900#周口","3901#驻马店","3903#石家庄","3904#保定","3905#沧州","3906#承德","3907#邯郸","3908#衡水","3909#廊坊","3910#秦皇岛","3911#唐山","3912#邢台","3913#张家口","3915#沈阳","3916#鞍山","3917#本溪","3918#朝阳","3919#大连","3920#丹东","3921#抚顺","3922#阜新","3923#葫芦岛","3924#锦州","3925#辽阳","3926#盘锦","3927#铁岭","3928#营口","3930#西安","3931#安康","3932#宝鸡","3933#汉中","3934#商洛","3935#铜川","3936#渭南","3937#咸阳","3938#延安","3939#榆林","3941#合肥","3942#安庆","3943#蚌埠","3944#亳州","3945#巢湖","3946#池州","3947#滁州","3948#阜阳","3949#淮北","3950#淮南","3951#黄山","3952#六安","3953#马鞍山","3954#宿州","3955#铜陵","3956#芜湖","3957#宣城","3959#宝坻","3960#北辰","3961#大港","3962#东丽","3963#汉沽","3964#和平","3965#河北","3966#河东","3967#河西","3968#红桥","3969#蓟县","3970#津南","3971#静海","3972#南开","3973#宁河","3974#塘沽","3975#武清","3976#西青","3978#南昌","3979#抚州","3980#赣州","3981#吉安","3982#景德镇","3983#九江","3984#萍乡","3985#上饶","3986#新余","3987#宜春","3988#鹰潭","3990#昆明","3991#保山","3992#楚雄","3993#大理","3994#德宏","3995#迪庆","3996#红河","3997#丽江","3998#临沧","3999#怒江","4000#曲靖","4001#普洱","4002#文山","4003#西双版纳","4004#玉溪","4005#昭通","4007#哈尔滨","4008#大庆","4009#大兴安岭","4010#鹤岗","4011#黑河","4012#鸡西","4013#佳木斯","4014#牡丹江","4015#七台河","4016#齐齐哈尔","4017#双鸭山","4018#绥化","4019#伊春","4021#太原","4022#长治","4023#大同","4024#晋城","4025#晋中","4026#临汾","4027#吕梁","4028#朔州","4029#忻州","4030#阳泉","4031#运城","4033#长春","4034#白城","4035#白山","4036#吉林","4037#辽源","4038#四平","4039#松原","4040#通化","4041#延边","4043#贵阳","4044#安顺","4045#毕节","4046#六盘水","4047#黔东南","4048#黔南","4049#黔西南","4050#铜仁","4051#遵义","4053#海口","4054#白沙","4055#保亭","4056#昌江","4057#澄迈","4058#儋州","4059#定安","4060#东方","4061#乐东","4062#临高","4063#陵水","4064#南沙群岛","4065#琼海","4066#琼中","4067#三亚","4068#屯昌","4069#万宁","4070#文昌","4071#五指山","4072#西沙群岛","4073#中沙群岛","4075#兰州","4076#白银","4077#定西","4078#甘南","4079#嘉峪关","4080#金昌","4081#酒泉","4082#临夏","4083#陇南","4084#平凉","4085#庆阳","4086#天水","4087#武威","4088#张掖","4090#西宁","4091#果洛","4092#海北","4093#海东","4094#海南","4095#海西","4096#黄南","4097#玉树","4099#银川","4100#固原","4101#石嘴山","4102#吴忠","4103#中卫","4105#呼和浩特","4106#阿拉善","4107#巴彦淖尔","4108#包头","4109#赤峰","4110#鄂尔多斯","4111#呼伦贝尔","4112#通辽","4113#乌海","4114#乌兰察布","4115#锡林郭勒","4116#兴安","4118#乌鲁木齐","4119#阿克苏","4120#阿拉尔","4121#阿勒泰","4122#巴音郭楞","4123#博尔塔拉","4124#昌吉","4125#哈密","4126#和田","4127#喀什","4128#克拉玛依","4129#克孜勒苏柯尔克孜","4130#石河子","4131#塔城","4132#图木舒克","4133#吐鲁番","4134#五家渠","4135#伊犁","4137#拉萨","4138#阿里","4139#昌都","4140#林芝","4141#那曲","4142#日喀则","4143#山南","4145#澳门"};
		for(String s : ss) {
			String id = s.split("#")[0];
			String name = s.split("#")[1];
			
			sqlCodeMap.put(name, id);
		}
		System.err.println(sqlCodeMap.size());
	}
	
	private static void printUpdateCodeSQL(){
		for(Map.Entry<String, String> me : sqlCodeMap.entrySet()) {
			String baiduCode = baiduCodeMap.get(me.getKey());
			
			if(baiduCode != null) {
				System.err.println("update t_app_area set baidu_code="+baiduCode+" where id="+me.getValue()+";");
			} else {
				//System.out.println(me.getKey());
			}
		}
	}
	
	private static class ProvinceLBS {
		private String id;
		private String name;
		private String lng;
		private String lat;
		private String pid;
		
		public ProvinceLBS(String id , String name , String lng , String lat , String pid){
			this.id = id;
			this.name = name;
			this.lng = lng;
			this.lat = lat;
			this.pid = pid;
		}
	}
	
	private static Map<String , ProvinceLBS> provinceLBSMap = new HashMap<>();
	
	private static void initLBS(){
		String[] ss = new String[]{"3593#北京#116.403981#39.914935","3612#上海#121.480308#31.236259","3631#香港#114.1832#22.283894","3652#台湾#121.550742#25.050826","3696#广东#113.260636#23.138613","3718#浙江#120.151923#30.244728","3730#江苏#118.805638#32.076268","3744#四川#104.072559#30.664627","3766#重庆#106.567806#29.553181","3807#湖南#112.943356#28.185564","3822#湖北#114.312703#30.549484","3840#福建#119.321364#26.015487","3850#广西#108.35981#22.811604","3865#山东#117.023108#36.668811","3883#河南#113.656357#34.762735","3902#河北#114.501758#38.037058","3914#辽宁#123.435102#41.803184","3929#陕西#108.952538#34.288177","3940#安徽#108.952538#34.288177","3958#天津#117.189067#39.181021","3977#江西#115.920292#28.664438","3989#云南#102.732289#25.049943","4006#黑龙江#126.650646#45.774909","4020#山西#112.563842#37.85426","4032#吉林#126.583006#43.880544","4042#贵州#106.698555#26.600415","4052#海南#110.321292#20.014959","4074#甘肃#103.828777#36.051926","4089#青海#101.775029#36.628077","4098#宁夏#106.264093#38.455612","4104#内蒙古#111.705337#40.818373","4117#新疆#87.604678#43.823404","4136#西藏#91.142713#29.654421","4144#澳门#113.557633#22.19794"};
		for(String s : ss) {
			String[] v = s.split("#");
			
			provinceLBSMap.put(v[0], new ProvinceLBS(v[0] , v[1] , v[2] , v[3] , "3592"));
		}
	}
	
	private static List<ProvinceLBS> cityLBSList = new ArrayList<>();
	private static void initCityLBS(){
		String[] ss = new String[]{"3594#昌平#3593","3595#朝阳#3593","3596#崇文#3593","3597#大兴#3593","3598#东城#3593","3599#房山#3593","3600#丰台#3593","3601#海淀#3593","3602#怀柔#3593","3603#门头沟#3593","3604#密云#3593","3605#平谷#3593","3606#石景山#3593","3607#顺义#3593","3608#通州#3593","3609#西城#3593","3610#宣武#3593","3611#延庆#3593","3613#宝山#3612","3614#长宁#3612","3615#崇明#3612","3616#奉贤#3612","3617#虹口#3612","3618#黄浦#3612","3619#嘉定#3612","3620#金山#3612","3621#静安#3612","3622#卢湾#3612","3623#闵行#3612","3624#浦东#3612","3625#普陀#3612","3626#青浦#3612","3627#松江#3612","3628#徐汇#3612","3629#杨浦#3612","3630#闸北#3612","3632#北区#3631","3633#大埔区#3631","3634#东区#3631","3635#观塘区#3631","3636#黄大仙区#3631","3637#九龙#3631","3638#葵青区#3631","3639#离岛区#3631","3640#南区#3631","3641#荃湾区#3631","3642#沙田区#3631","3643#深水埗区#3631","3644#屯门区#3631","3645#湾仔区#3631","3646#西贡区#3631","3647#香港#3631","3648#新界#3631","3649#油尖旺区#3631","3650#元朗区#3631","3651#中西区#3631","3653#台北#3652","3654#阿莲#3652","3655#安定#3652","3656#安平#3652","3657#八德#3652","3658#八里#3652","3659#白河#3652","3660#白沙#3652","3661#板桥#3652","3662#褒忠#3652","3663#宝山#3652","3664#卑南#3652","3665#北斗#3652","3666#北港#3652","3667#北门#3652","3668#北埔#3652","3669#北投#3652","3670#补子#3652","3671#布袋#3652","3672#草屯#3652","3673#长宾#3652","3674#长治#3652","3675#潮州#3652","3676#车城#3652","3677#成功#3652","3678#城中区#3652","3679#池上#3652","3680#春日#3652","3681#刺桐#3652","3682#高雄#3652","3683#花莲#3652","3684#基隆#3652","3685#嘉义#3652","3686#苗栗#3652","3687#南投#3652","3688#屏东#3652","3689#台东#3652","3690#台南#3652","3691#台中#3652","3692#桃园#3652","3693#新竹#3652","3694#宜兰#3652","3695#彰化#3652","3697#广州#3696","3698#韶关#3696","3699#深圳#3696","3700#珠海#3696","3701#汕头#3696","3702#佛山#3696","3703#江门#3696","3704#湛江#3696","3705#茂名#3696","3706#肇庆#3696","3707#惠州#3696","3708#梅州#3696","3709#汕尾#3696","3710#河源#3696","3711#阳江#3696","3712#清远#3696","3713#东莞#3696","3714#中山#3696","3715#潮州#3696","3716#揭阳#3696","3717#云浮#3696","3719#杭州#3718","3720#湖州#3718","3721#嘉兴#3718","3722#金华#3718","3723#丽水#3718","3724#宁波#3718","3725#衢州#3718","3726#绍兴#3718","3727#台州#3718","3728#温州#3718","3729#舟山#3718","3731#南京#3730","3732#常州#3730","3733#淮安#3730","3734#连云港#3730","3735#南通#3730","3736#苏州#3730","3737#宿迁#3730","3738#泰州#3730","3739#无锡#3730","3740#徐州#3730","3741#盐城#3730","3742#扬州#3730","3743#镇江#3730","3745#成都#3744","3746#阿坝#3744","3747#巴中#3744","3748#达州#3744","3749#德阳#3744","3750#甘孜#3744","3751#广安#3744","3752#广元#3744","3753#乐山#3744","3754#凉山#3744","3755#泸州#3744","3756#眉山#3744","3757#绵阳#3744","3758#内江#3744","3759#南充#3744","3760#攀枝花#3744","3761#遂宁#3744","3762#雅安#3744","3763#宜宾#3744","3764#资阳#3744","3765#自贡#3744","3767#巴南#3766","3768#北碚#3766","3769#璧山#3766","3770#长寿#3766","3771#城口#3766","3772#大渡口#3766","3773#大足#3766","3774#垫江#3766","3775#丰都#3766","3776#奉节#3766","3777#涪陵#3766","3778#合川#3766","3779#江北#3766","3780#江津#3766","3781#九龙坡#3766","3782#开县#3766","3783#梁平#3766","3784#南岸#3766","3785#南川#3766","3786#彭水#3766","3787#綦江#3766","3788#黔江#3766","3789#荣昌#3766","3790#沙坪坝#3766","3791#石柱#3766","3792#双桥#3766","3793#铜梁#3766","3794#潼南#3766","3795#万盛#3766","3796#万州#3766","3797#巫山#3766","3798#巫溪#3766","3799#武隆#3766","3800#秀山#3766","3801#永川#3766","3802#酉阳#3766","3803#渝北#3766","3804#渝中#3766","3805#云阳#3766","3806#忠县#3766","3808#长沙#3807","3809#常德#3807","3810#郴州#3807","3811#衡阳#3807","3812#怀化#3807","3813#娄底#3807","3814#邵阳#3807","3815#湘潭#3807","3816#湘西#3807","3817#益阳#3807","3818#永州#3807","3819#岳阳#3807","3820#张家界#3807","3821#株洲#3807","3823#武汉#3822","3824#鄂州#3822","3825#恩施#3822","3826#黄冈#3822","3827#黄石#3822","3828#荆门#3822","3829#荆州#3822","3830#潜江#3822","3831#神农架#3822","3832#十堰#3822","3833#随州#3822","3834#天门#3822","3835#仙桃#3822","3836#咸宁#3822","3837#襄樊#3822","3838#孝感#3822","3839#宜昌#3822","3841#福州#3840","3842#龙岩#3840","3843#南平#3840","3844#宁德#3840","3845#莆田#3840","3846#泉州#3840","3847#三明#3840","3848#厦门#3840","3849#漳州#3840","3851#南宁#3850","3852#柳州#3850","3853#桂林#3850","3854#梧州#3850","3855#北海#3850","3856#防城港#3850","3857#钦州#3850","3858#贵港#3850","3859#玉林#3850","3860#百色#3850","3861#贺州#3850","3862#河池#3850","3863#来宾#3850","3864#崇左#3850","3866#济南#3865","3867#滨州#3865","3868#德州#3865","3869#东营#3865","3870#菏泽#3865","3871#济宁#3865","3872#莱芜#3865","3873#聊城#3865","3874#临沂#3865","3875#青岛#3865","3876#日照#3865","3877#泰安#3865","3878#威海#3865","3879#潍坊#3865","3880#烟台#3865","3881#枣庄#3865","3882#淄博#3865","3884#郑州#3883","3885#安阳#3883","3886#鹤壁#3883","3887#焦作#3883","3888#济源#3883","3889#开封#3883","3890#洛阳#3883","3891#漯河#3883","3892#南阳#3883","3893#平顶山#3883","3894#濮阳#3883","3895#三门峡#3883","3896#商丘#3883","3897#新乡#3883","3898#信阳#3883","3899#许昌#3883","3900#周口#3883","3901#驻马店#3883","3903#石家庄#3902","3904#保定#3902","3905#沧州#3902","3906#承德#3902","3907#邯郸#3902","3908#衡水#3902","3909#廊坊#3902","3910#秦皇岛#3902","3911#唐山#3902","3912#邢台#3902","3913#张家口#3902","3915#沈阳#3914","3916#鞍山#3914","3917#本溪#3914","3918#朝阳#3914","3919#大连#3914","3920#丹东#3914","3921#抚顺#3914","3922#阜新#3914","3923#葫芦岛#3914","3924#锦州#3914","3925#辽阳#3914","3926#盘锦#3914","3927#铁岭#3914","3928#营口#3914","3930#西安#3929","3931#安康#3929","3932#宝鸡#3929","3933#汉中#3929","3934#商洛#3929","3935#铜川#3929","3936#渭南#3929","3937#咸阳#3929","3938#延安#3929","3939#榆林#3929","3941#合肥#3940","3942#安庆#3940","3943#蚌埠#3940","3944#亳州#3940","3945#巢湖#3940","3946#池州#3940","3947#滁州#3940","3948#阜阳#3940","3949#淮北#3940","3950#淮南#3940","3951#黄山#3940","3952#六安#3940","3953#马鞍山#3940","3954#宿州#3940","3955#铜陵#3940","3956#芜湖#3940","3957#宣城#3940","3959#宝坻#3958","3960#北辰#3958","3961#大港#3958","3962#东丽#3958","3963#汉沽#3958","3964#和平#3958","3965#河北#3958","3966#河东#3958","3967#河西#3958","3968#红桥#3958","3969#蓟县#3958","3970#津南#3958","3971#静海#3958","3972#南开#3958","3973#宁河#3958","3974#塘沽#3958","3975#武清#3958","3976#西青#3958","3978#南昌#3977","3979#抚州#3977","3980#赣州#3977","3981#吉安#3977","3982#景德镇#3977","3983#九江#3977","3984#萍乡#3977","3985#上饶#3977","3986#新余#3977","3987#宜春#3977","3988#鹰潭#3977","3990#昆明#3989","3991#保山#3989","3992#楚雄#3989","3993#大理#3989","3994#德宏#3989","3995#迪庆#3989","3996#红河#3989","3997#丽江#3989","3998#临沧#3989","3999#怒江#3989","4000#曲靖#3989","4001#普洱#3989","4002#文山#3989","4003#西双版纳#3989","4004#玉溪#3989","4005#昭通#3989","4007#哈尔滨#4006","4008#大庆#4006","4009#大兴安岭#4006","4010#鹤岗#4006","4011#黑河#4006","4012#鸡西#4006","4013#佳木斯#4006","4014#牡丹江#4006","4015#七台河#4006","4016#齐齐哈尔#4006","4017#双鸭山#4006","4018#绥化#4006","4019#伊春#4006","4021#太原#4020","4022#长治#4020","4023#大同#4020","4024#晋城#4020","4025#晋中#4020","4026#临汾#4020","4027#吕梁#4020","4028#朔州#4020","4029#忻州#4020","4030#阳泉#4020","4031#运城#4020","4033#长春#4032","4034#白城#4032","4035#白山#4032","4036#吉林#4032","4037#辽源#4032","4038#四平#4032","4039#松原#4032","4040#通化#4032","4041#延边#4032","4043#贵阳#4042","4044#安顺#4042","4045#毕节#4042","4046#六盘水#4042","4047#黔东南#4042","4048#黔南#4042","4049#黔西南#4042","4050#铜仁#4042","4051#遵义#4042","4053#海口#4052","4054#白沙#4052","4055#保亭#4052","4056#昌江#4052","4057#澄迈#4052","4058#儋州#4052","4059#定安#4052","4060#东方#4052","4061#乐东#4052","4062#临高#4052","4063#陵水#4052","4064#南沙群岛#4052","4065#琼海#4052","4066#琼中#4052","4067#三亚#4052","4068#屯昌#4052","4069#万宁#4052","4070#文昌#4052","4071#五指山#4052","4072#西沙群岛#4052","4073#中沙群岛#4052","4075#兰州#4074","4076#白银#4074","4077#定西#4074","4078#甘南#4074","4079#嘉峪关#4074","4080#金昌#4074","4081#酒泉#4074","4082#临夏#4074","4083#陇南#4074","4084#平凉#4074","4085#庆阳#4074","4086#天水#4074","4087#武威#4074","4088#张掖#4074","4090#西宁#4089","4091#果洛#4089","4092#海北#4089","4093#海东#4089","4094#海南#4089","4095#海西#4089","4096#黄南#4089","4097#玉树#4089","4099#银川#4098","4100#固原#4098","4101#石嘴山#4098","4102#吴忠#4098","4103#中卫#4098","4105#呼和浩特#4104","4106#阿拉善#4104","4107#巴彦淖尔#4104","4108#包头#4104","4109#赤峰#4104","4110#鄂尔多斯#4104","4111#呼伦贝尔#4104","4112#通辽#4104","4113#乌海#4104","4114#乌兰察布#4104","4115#锡林郭勒#4104","4116#兴安#4104","4118#乌鲁木齐#4117","4119#阿克苏#4117","4120#阿拉尔#4117","4121#阿勒泰#4117","4122#巴音郭楞#4117","4123#博尔塔拉#4117","4124#昌吉#4117","4125#哈密#4117","4126#和田#4117","4127#喀什#4117","4128#克拉玛依#4117","4129#克孜勒苏柯尔克孜#4117","4130#石河子#4117","4131#塔城#4117","4132#图木舒克#4117","4133#吐鲁番#4117","4134#五家渠#4117","4135#伊犁#4117","4137#拉萨#4136","4138#阿里#4136","4139#昌都#4136","4140#林芝#4136","4141#那曲#4136","4142#日喀则#4136","4143#山南#4136","4145#澳门#4144"};
		for(String s : ss) {
			String[] v = s.split("#");
			
			cityLBSList.add(new ProvinceLBS(v[0] , v[1] , null , null , v[2]));
		}
	}
	
	private static void foreachMap(){
		for(ProvinceLBS cityLBS : cityLBSList) {
			try {
				ProvinceLBS provinceLBS = provinceLBSMap.get(cityLBS.pid);
				if(provinceLBS.name.equals(cityLBS.name)) {
					cityLBS.lat = provinceLBS.lat;
					cityLBS.lng = provinceLBS.lng;
				} else {
					//调用百度地图
					BmapPoint point = BaiduUtils.getByAddress(cityLBS.name, provinceLBS.name);
					if(point == null) {
						System.err.println("城市:"+cityLBS.name+",id:"+cityLBS.id+",未匹配到经纬度");
					} else {
						cityLBS.lat = String.valueOf(point.getLat());
						cityLBS.lng = String.valueOf(point.getLng());
					}
				}
				//休息一下
				Thread.sleep(100L);
			} catch (Exception e) {
				e.printStackTrace();
			}
		}
	}
	
	private static void printCityLBS(){
		for(ProvinceLBS cityLBS : cityLBSList) {
			if(cityLBS.lat != null) {
				System.err.println("update t_app_area set lng="+cityLBS.lng+",lat="+cityLBS.lat+" where id="+cityLBS.id);
			}
		}
	}
	
	public static void main(String[] args) throws Exception {
		int a = 5;
		int b = 5;
		int x = 2*b++;
		System.err.println(x);
		int y = 2*(a++);
		System.err.println(y);
		//初始化旧的城市数据
		//initOld();
		//加载新的国家信息
		//initCountry();
		//initChina();
		//sssksk();
		//输出
		//p();
		//baiduCode();
		//initMysqlCity();
		//printUpdateCodeSQL();
		
		//经纬度
		//initLBS();
		//initCityLBS();
		//foreachMap();
		//printCityLBS();
		//初始化城市信息
		
	}
	

}
